# Pandas教程

### 2017七月在线 Python数据分析基础课 julyedu.com
by 褚则伟

## 目录
- Index
- csv文件读写

## Index

### index object

In [1]:
import pandas as pd
import numpy as np

自己建一个index object

In [2]:
index = pd.Index(["Shanghai", "Beijing", "Guangzhou", "Shenzhen"])
index

Index(['Shanghai', 'Beijing', 'Guangzhou', 'Shenzhen'], dtype='object')

In [3]:
"Shanghai" in index

True

从Series里面拿出一个index object

In [6]:
obj = pd.Series(range(3), index=["a", "b", "c"])
obj_index = obj.index

In [8]:
obj_index[1:]

Index(['b', 'c'], dtype='object')

index的值是不能被更改的

In [5]:
index[1] = "Hangzhou"

TypeError: Index does not support mutable operations

创建Series时声明index

In [9]:
index

Index(['Shanghai', 'Beijing', 'Guangzhou', 'Shenzhen'], dtype='object')

In [11]:
apts = pd.Series([60000, 50000, 20000, 55000], index=index, name="apts")
apts

Shanghai     60000
Beijing      50000
Guangzhou    20000
Shenzhen     55000
Name: apts, dtype: int64

sex_index

In [12]:
df = pd.DataFrame({"city": ["Beijing", "Beijing", "Shanghai", "Shanghai"],
                  "year": [2016, 2017, 2016, 2017],
                  "label": [0, 1, 2, 3],
                  "population": [2100, 2200, 2300, 2400]})
df

       city  label  population  year
0   Beijing      0        2100  2016
1   Beijing      1        2200  2017
2  Shanghai      2        2300  2016
3  Shanghai      3        2400  2017

In [14]:
df_label = df.set_index("label")
df_label

           city  population  year
label
0       Beijing        2100  2016
1       Beijing        2200  2017
2      Shanghai        2300  2016
3      Shanghai        2400  2017

In [15]:
df.set_index("label", drop=False)

           city  label  population  year
label
0       Beijing      0        2100  2016
1       Beijing      1        2200  2017
2      Shanghai      2        2300  2016
3      Shanghai      3        2400  2017

In [16]:
df.set_index(["city", "year"])

               label  population
city     year
Beijing  2016      0        2100
         2017      1        2200
Shanghai 2016      2        2300
         2017      3        2400

In [18]:
df_label.set_index(["city", "year"])

               population
city     year
Beijing  2016        2100
         2017        2200
Shanghai 2016        2300
         2017        2400

In [21]:
df3 = df_label.set_index(["city", "year"], append=True)
df3

                     population
label city     year
0     Beijing  2016        2100
1     Beijing  2017        2200
2     Shanghai 2016        2300
3     Shanghai 2017        2400

In [22]:
df3.reset_index()

   label      city  year  population
0      0   Beijing  2016        2100
1      1   Beijing  2017        2200
2      2  Shanghai  2016        2300
3      3  Shanghai  2017        2400

In [24]:
df3.reset_index(level=1)

                city  population
label year
0     2016   Beijing        2100
1     2017   Beijing        2200
2     2016  Shanghai        2300
3     2017  Shanghai        2400

In [25]:
df3.reset_index(level=[1,2])

           city  year  population
label
0       Beijing  2016        2100
1       Beijing  2017        2200
2      Shanghai  2016        2300
3      Shanghai  2017        2400

In [26]:
df3.index

MultiIndex(levels=[[0, 1, 2, 3], ['Beijing', 'Shanghai'], [2016, 2017]],
           labels=[[0, 1, 2, 3], [0, 0, 1, 1], [0, 1, 0, 1]],
           names=['label', 'city', 'year'])

### 针对index进行索引和切片

In [27]:
s = pd.Series(np.arange(4), index=["a", "b", 'c', 'd'])
s

a    0
b    1
c    2
d    3
dtype: int64

In [28]:
s['b']

1

默认的数字index依旧可以使用

In [30]:
s[2]

2

In [31]:
s[[2,1]]

c    2
b    1
dtype: int64

下面是如何对Series进行切片

In [32]:
s['b':'c']

b    1
c    2
dtype: int64

对DataFrame进行Indexing与Series基本相同

In [34]:
df = pd.DataFrame(np.arange(9).reshape(3,3), 
                 index = ['a', 'b', 'c'],
                 columns = ['x', 'y', 'z'])
df.index

Index(['a', 'b', 'c'], dtype='object')

In [35]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [40]:
df.T

   a  b  c
x  0  3  6
y  1  4  7
z  2  5  8

In [41]:
df

   x  y  z
a  0  1  2
b  3  4  5
c  6  7  8

In [42]:
df[["x", "z"]]

   x  z
a  0  2
b  3  5
c  6  8

In [47]:
df.loc["a":"b", "x":"y"]

   x  y
a  0  1
b  3  4

DataFrame也可以用condition selection

In [50]:
df[df.x < 5]

   x  y  z
a  0  1  2
b  3  4  5

In [52]:
df[df<5] = 0
df

   x  y  z
a  0  0  0
b  0  0  5
c  6  7  8

### [reindex](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.reindex.html)

把一个Series或者DataFrame按照新的index顺序进行重排

In [53]:
s = pd.Series([4.5, 2.7, 8.9, -0.4], index = ['d', 'b', 'a', 'c'])
s

d    4.5
b    2.7
a    8.9
c   -0.4
dtype: float64

In [55]:
s.reindex(['a', 'b', 'c', 'd', 'e'])

a    8.9
b    2.7
c   -0.4
d    4.5
e    NaN
dtype: float64

In [56]:
s = pd.Series(['blue', 'red', 'yellow'], index=[0,2,4])
s

0      blue
2       red
4    yellow
dtype: object

In [59]:
s.reindex(range(6), method="ffill")

0      blue
1      blue
2       red
3       red
4    yellow
5    yellow
dtype: object

In [60]:
s.reindex(range(6), method="bfill")

0      blue
1       red
2       red
3    yellow
4    yellow
5       NaN
dtype: object

既然我们可以对Series进行reindex，相应地，我们也可以用同样的方法对DataFrame进行reindex。

In [64]:
df = pd.DataFrame(np.arange(9).reshape(3,3), 
                 index = ['b', 'a', 'd'],
                 columns = ['y', 'z', 'x'])
df

   y  z  x
b  0  1  2
a  3  4  5
d  6  7  8

In [63]:
df = df.reindex(['a', 'b', 'c', 'd'])
df

     x    y    z
a  3.0  4.0  5.0
b  0.0  1.0  2.0
c  NaN  NaN  NaN
d  6.0  7.0  8.0

In [66]:
df = df.reindex(['a', 'b', 'c', 'd'], columns = ['x', 'y', 'z'])
df

     x    y    z
a  5.0  3.0  4.0
b  2.0  0.0  1.0
c  NaN  NaN  NaN
d  8.0  6.0  7.0

在reindex的同时，我们还可以重新指定columns

下面介绍如何用drop来删除Series和DataFrame中的index

In [68]:
df2 = df.drop("b")
df2

     x    y    z
a  5.0  3.0  4.0
c  NaN  NaN  NaN
d  8.0  6.0  7.0

In [69]:
df.drop(["a", "c"])

     x    y    z
b  2.0  0.0  1.0
d  8.0  6.0  7.0

In [72]:
df.drop(["y", "x"], axis=1)

     z
a  4.0
b  1.0
c  NaN
d  7.0

drop不仅仅可以删除行，还可以删除列

In [73]:
df

     x    y    z
a  5.0  3.0  4.0
b  2.0  0.0  1.0
c  NaN  NaN  NaN
d  8.0  6.0  7.0

### hierarchical index

Series的hierarchical indexing

In [74]:
data = pd.Series(np.random.randn(10), index = [["a", 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd', 'd'],\
                                               [1,2,3,1,2,1,2,1,2,3]])
data

a  1    0.749063
   2   -1.377602
   3   -0.243244
b  1    0.807103
   2   -0.817357
c  1   -0.177958
   2    1.181911
d  1    0.485940
   2    1.860314
   3    0.545842
dtype: float64

In [75]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3, 3], [0, 1, 2, 0, 1, 0, 1, 0, 1, 2]])

In [78]:
type(data)

pandas.core.series.Series

In [80]:
data["b": "c"]

b  1    0.807103
   2   -0.817357
c  1   -0.177958
   2    1.181911
dtype: float64

In [81]:
data[:2]

a  1    0.749063
   2   -1.377602
dtype: float64

unstack和stack可以帮助我们在hierarchical indexing和DataFrame之间进行切换。

In [86]:
unstacked = data.unstack()
unstacked

          1         2         3
a  0.749063 -1.377602 -0.243244
b  0.807103 -0.817357       NaN
c -0.177958  1.181911       NaN
d  0.485940  1.860314  0.545842

In [83]:
type(data.unstack())

pandas.core.frame.DataFrame

In [87]:
unstacked.stack()

a  1    0.749063
   2   -1.377602
   3   -0.243244
b  1    0.807103
   2   -0.817357
c  1   -0.177958
   2    1.181911
d  1    0.485940
   2    1.860314
   3    0.545842
dtype: float64

In [89]:
df.stack()

a  x    5.0
   y    3.0
   z    4.0
b  x    2.0
   y    0.0
   z    1.0
d  x    8.0
   y    6.0
   z    7.0
dtype: float64

DataFrame的hierarchical indexing

In [91]:
df = pd.DataFrame(np.arange(12).reshape(4,3),
                    index = [["a", "a", 'b', 'b'], [1,2,1,2]],
                    columns = [["x", "y", "y"], [1,1,2]])
df

     x   y
     1   1   2
a 1  0   1   2
  2  3   4   5
b 1  6   7   8
  2  9  10  11

In [92]:
df.index.names = ["key1", "key2"]
df.columns.names = ["column1", "column2"]
df

column1    x   y
column2    1   1   2
key1 key2
a    1     0   1   2
     2     3   4   5
b    1     6   7   8
     2     9  10  11

In [98]:
df.loc['a'].loc[1]["x"][1]

0

## csv文件读写

- [read_csv](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html)
- [to_csv](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_csv.html)

In [1]:
import pandas as pd
goog = pd.read_csv("data/GOOG.csv", index_col=0)
# goog

In [2]:
goog.index

Index(['2004-08-19', '2004-08-20', '2004-08-23', '2004-08-24', '2004-08-25',
       '2004-08-26', '2004-08-27', '2004-08-30', '2004-08-31', '2004-09-01',
       ...
       '2017-07-07', '2017-07-10', '2017-07-11', '2017-07-12', '2017-07-13',
       '2017-07-14', '2017-07-17', '2017-07-18', '2017-07-19', '2017-07-20'],
      dtype='object', name='Date', length=3253)

In [104]:
# goog = goog.set_index("Date")

In [3]:
goog = goog.reindex(pd.to_datetime(goog.index))
goog.index

DatetimeIndex(['2004-08-19', '2004-08-20', '2004-08-23', '2004-08-24',
               '2004-08-25', '2004-08-26', '2004-08-27', '2004-08-30',
               '2004-08-31', '2004-09-01',
               ...
               '2017-07-07', '2017-07-10', '2017-07-11', '2017-07-12',
               '2017-07-13', '2017-07-14', '2017-07-17', '2017-07-18',
               '2017-07-19', '2017-07-20'],
              dtype='datetime64[ns]', name='Date', length=3253, freq=None)

In [107]:
goog.head()

                 Open       High        Low      Close  Adj Close    Volume
Date
2004-08-19  49.813286  51.835709  47.800831  49.982655  49.982655  44871300
2004-08-20  50.316402  54.336334  50.062355  53.952770  53.952770  22942800
2004-08-23  55.168217  56.528118  54.321388  54.495735  54.495735  18342800
2004-08-24  55.412300  55.591629  51.591621  52.239193  52.239193  15319700
2004-08-25  52.284027  53.798351  51.746044  52.802086  52.802086   9232100

In [108]:
goog.tail()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2017-07-14,952.000000,956.909973,948.005005,955.989990,955.989990,1053800
2017-07-17,957.000000,960.739990,949.241028,953.419983,953.419983,1165500
2017-07-18,953.000000,968.039978,950.599976,965.400024,965.400024,1154000
2017-07-19,967.840027,973.039978,964.030029,970.890015,970.890015,1224500
2017-07-20,975.000000,975.900024,961.510010,968.150024,968.150024,1616500

In [111]:
df.to_csv("data/sample.tsv", sep="\t")

## exercise
download stock data from yahoo finance, and use read_csv to create dataframe, and play with the dataframe.